&НаСервере 
Функция ИнициализироватьНаСервере ()
	Возврат PeopleAPIСервер.ПолучитьURLАвторизации()   
КонецФункции
   
   
&НаКлиенте
Процедура Инициализировать(Команда)             
	
	// Получение URL авторизации
	Адрес = ИнициализироватьНаСервере();
	
КонецПроцедуры        

&НаКлиенте
Процедура ПолеHTMLДокументСформирован(Элемент)
	
	Адрес = Элемент.Документ.URL;
	Если СтрНайти(ВРег(Адрес), ВРег("code="), НаправлениеПоиска.СНачала) > 0 Тогда
		КодАвторизации = ИзвлечьКодАвторизации(Адрес);
		Если НЕ ПустаяСтрока(КодАвторизации) Тогда
			Закрыть(КодАвторизации);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИзвлечьКодАвторизации(URL)
	НачалоКода = СтрНайти(ВРЕГ(URL), ВРЕГ("code="), НаправлениеПоиска.СНачала);
	Если НачалоКода = 0 Тогда
		Возврат "";
	КонецЕсли;
	НачалоКода = НачалоКода + 5;
	КонецКода = СтрНайти(URL, "&", НаправлениеПоиска.СНачала, НачалоКода);
	Если КонецКода = 0 Тогда
		Возврат Сред(URL, НачалоКода);
	КонецЕсли;

	Возврат Сред(URL, НачалоКода, КонецКода - НачалоКода);
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)     
	Настройки = Справочники.НастройкиИнтеграцииGoogle.НайтиПоНаименованию("Основные");
	Если Не Настройки.Пустая() Тогда
		Объект.client_id = Настройки.КлиентID;
		Объект.client_secret = Настройки.СекретКлиента;
	КонецЕсли;
КонецПроцедуры         



