&НаСервере 
Функция ИнициализироватьНаСервере ()
	Возврат PeopleAPIСервер.ПолучитьURLАвторизации()   
КонецФункции
   
   
&НаКлиенте
Процедура Инициализировать(Команда)             
	
	// Получение URL авторизации
	адрес = ИнициализироватьНаСервере ();
	
КонецПроцедуры        

&НаКлиенте
Процедура ПолеHTMLДокументСформирован(Элемент)
	
	Адрес = Элемент.Документ.URL;
	if Адрес = "about:blank" Then
		InnerHTML = Элемент.Документ.body.InnerHTML;
		AuthCode = AuthCode(InnerHTML);
		Закрыть(AuthCode);
	endif
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция AuthCode(URL)
	НачалоКода = СтрНайти(ВРЕГ(URL), ВРЕГ("code="), НаправлениеПоиска.СНачала);
	Если НачалоКода = 0 Тогда
		Возврат "";
	КонецЕсли;
	НачалоКода = НачалоКода + 5;
	КонецКода = СтрНайти(ВРЕГ(URL), ВРЕГ("&amp;"), НаправлениеПоиска.СНачала, НачалоКода);
	Возврат Сред(URL, НачалоКода, КонецКода - НачалоКода);
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)     
	Настройки = Справочники.НастройкиИнтеграцииGoogle.НайтиПоНаименованию("Основные");
	Если ЗначениеЗаполнено(Настройки) Тогда
		Объект.client_id = Настройки.client_id;
		Объект.client_secret = Настройки.client_secret;
	КонецЕсли;
КонецПроцедуры         



